# lab1_facade.py

"""
Цей модуль містить фасад для лабораторної роботи 1,
що забезпечує простий інтерфейс для виконання обчислень.
"""

from labs.lab1.main import calculate

class Lab1Facade:
    """
    Клас фасаду для лабораторної роботи 1, що спрощує виклик функції обчислення.
    """

    def __init__(self):
        """
        Ініціалізація фасаду.
        """
        pass

    def execute(self):
        """
        Виконує обчислення, викликаючи функцію calculate().
        """
        calculate()
